In [4]:
import pandas as pd
import numpy as np
data={
    'A':[1,2,np.nan,4,],
    'B':[5,np.nan,7,8],
    'C':[9,np.nan,11,np.nan],
    'D':[13,14,15,16]
}
df=pd.DataFrame(data)
df

     A    B     C   D
0  1.0  5.0   9.0  13
1  2.0  NaN   NaN  14
2  NaN  7.0  11.0  15
3  4.0  8.0   NaN  16

In [5]:
df.isnull

<bound method DataFrame.isnull of      A    B     C   D
0  1.0  5.0   9.0  13
1  2.0  NaN   NaN  14
2  NaN  7.0  11.0  15
3  4.0  8.0   NaN  16>

In [6]:
df.isnull().sum()

A    1
B    1
C    2
D    0
dtype: int64

In [8]:
df_dropped_rows=df.dropna()
df_dropped_rows

     A    B    C   D
0  1.0  5.0  9.0  13

In [9]:
df_dropped_columns=df.dropna(axis=1)
df_dropped_columns

    D
0  13
1  14
2  15
3  16

In [10]:
df_filled=df.fillna(0)
df_filled

     A    B     C   D
0  1.0  5.0   9.0  13
1  2.0  0.0   0.0  14
2  0.0  7.0  11.0  15
3  4.0  8.0   0.0  16